In [3]:
import numpy as np
import pandas as pd

In [7]:
s=pd.Series(list('abca'))

In [8]:
s

0    a
1    b
2    c
3    a
dtype: object

In [5]:
s1=['a','b',np.nan]

In [6]:
s1

['a', 'b', nan]

In [9]:
pd.get_dummies(s1)

   a  b
0  1  0
1  0  1
2  0  0

In [10]:
pd.get_dummies(s)

   a  b  c
0  1  0  0
1  0  1  0
2  0  0  1
3  1  0  0

In [11]:
pd.get_dummies(s1,dummy_na=True)

   a  b  NaN
0  1  0    0
1  0  1    0
2  0  0    1

In [12]:
df=pd.DataFrame({'A':['a','b','a'],'B':['b','a','c'],'C':[1,2,3]})
df

   A  B  C
0  a  b  1
1  b  a  2
2  a  c  3

In [13]:
pd.get_dummies(df)

   C  A_a  A_b  B_a  B_b  B_c
0  1    1    0    0    1    0
1  2    0    1    1    0    0
2  3    1    0    0    0    1

In [14]:
pd.get_dummies(df,prefix=['col1','col2'])

   C  col1_a  col1_b  col2_a  col2_b  col2_c
0  1       1       0       0       1       0
1  2       0       1       1       0       0
2  3       1       0       0       0       1

In [22]:
data=pd.read_csv('https://raw.githubusercontent.com/reddyprasade/Data-Sets-For-Machine-Learnig-and-Data-Science/master/DataSets/bank.csv')

In [16]:
data

,age,job,marital,education,default,balance,housing-loan,personal-loan,current-campaign,previous-campaign,subscribed
0,30,unemployed,married,primary,no,1787,no,no,1,0,no
1,33,services,married,secondary,no,4789,yes,yes,1,4,no
2,35,management,single,tertiary,no,1350,yes,no,1,1,no
3,30,management,married,tertiary,no,1476,yes,yes,4,0,no
4,59,blue-collar,married,secondary,no,0,yes,no,1,0,no
...,...,...,...,...,...,...,...,...,...,...,...
4516,33,services,married,secondary,no,-333,yes,no,5,0,no
4517,57,self-employed,married,tertiary,yes,-3313,yes,yes,1,0,no
4518,57,technician,married,secondary,no,295,no,no,11,0,no
4519,28,blue-collar,married,secondary,no,1137,no,no,4,3,no
4520,44,entrepreneur,single,tertiary,no,1136,yes,yes,2,7,no

In [23]:
data['marital']

0       married
1       married
2        single
3       married
4       married
         ...
4516    married
4517    married
4518    married
4519    married
4520     single
Name: marital, Length: 4521, dtype: object

In [18]:
a=data['marital']

In [19]:
a

0       married
1       married
2        single
3       married
4       married
         ...
4516    married
4517    married
4518    married
4519    married
4520     single
Name: marital, Length: 4521, dtype: object

In [20]:
pd.get_dummies(a)

      divorced  married  single
0            0        1       0
1            0        1       0
2            0        0       1
3            0        1       0
4            0        1       0
...        ...      ...     ...
4516         0        1       0
4517         0        1       0
4518         0        1       0
4519         0        1       0
4520         0        0       1

[4521 rows x 3 columns]

In [27]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4521 entries, 0 to 4520
Data columns (total 11 columns):
age                  4521 non-null int64
job                  4521 non-null object
marital              4521 non-null object
education            4521 non-null object
default              4521 non-null object
balance              4521 non-null int64
housing-loan         4521 non-null object
personal-loan        4521 non-null object
current-campaign     4521 non-null int64
previous-campaign    4521 non-null int64
subscribed           4521 non-null object
dtypes: int64(4), object(7)
memory usage: 388.6+ KB

In [28]:
data.describe()

               age       balance  current-campaign  previous-campaign
count  4521.000000   4521.000000       4521.000000        4521.000000
mean     41.170095   1422.657819          2.793630           0.542579
std      10.576211   3009.638142          3.109807           1.693562
min      19.000000  -3313.000000          1.000000           0.000000
25%      33.000000     69.000000          1.000000           0.000000
50%      39.000000    444.000000          2.000000           0.000000
75%      49.000000   1480.000000          3.000000           0.000000
max      87.000000  71188.000000         50.000000          25.000000

In [29]:
obj=data[['personal-loan','education','default','job','marital','housing-loan','subscribed']]
for i in obj:
    Data=pd.get_dummies(data[i])
    print(Data)

      no  yes
0      1    0
1      0    1
2      1    0
3      0    1
4      1    0
...   ..  ...
4516   1    0
4517   0    1
4518   1    0
4519   1    0
4520   0    1

[4521 rows x 2 columns]
      primary  secondary  tertiary  unknown
0           1          0         0        0
1           0          1         0        0
2           0          0         1        0
3           0          0         1        0
4           0          1         0        0
...       ...        ...       ...      ...
4516        0          1         0        0
4517        0          0         1        0
4518        0          1         0        0
4519        0          1         0        0
4520        0          0         1        0

[4521 rows x 4 columns]
      no  yes
0      1    0
1      1    0
2      1    0
3      1    0
4      1    0
...   ..  ...
4516   1    0
4517   0    1
4518   1    0
4519   1    0
4520   1    0

[4521 rows x 2 columns]
      admin.  blue-collar  entrepreneur  housemaid  management  retired  \
0          0            0             0          0           0        0
1          0            0             0          0           0        0
2          0            0             0          0           1        0
3          0            0             0          0           1        0
4          0            1             0          0           0        0
...      ...          ...           ...        ...         ...      ...
4516       0            0             0          0           0        0
4517       0            0             0          0           0        0
4518       0            0             0          0           0        0
4519       0            1             0          0           0        0
4520       0            0             1          0           0        0

      self-employed  services  student  technician  unemployed  unknown
0                 0         0        0           0           1        0
1                 0         1        0           0           0        0
2                 0         0        0           0           0        0
3                 0         0        0           0           0        0
4                 0         0        0           0           0        0
...             ...       ...      ...         ...         ...      ...
4516              0         1        0           0           0        0
4517              1         0        0           0           0        0
4518              0         0        0           1           0        0
4519              0         0        0           0           0        0
4520              0         0        0           0           0        0

[4521 rows x 12 columns]
      divorced  married  single
0            0        1       0
1            0        1       0
2            0        0       1
3            0        1       0
4            0        1       0
...        ...      ...     ...
4516         0        1       0
4517         0        1       0
4518         0        1       0
4519         0        1       0
4520         0        0       1

[4521 rows x 3 columns]
      no  yes
0      1    0
1      0    1
2      0    1
3      0    1
4      0    1
...   ..  ...
4516   0    1
4517   0    1
4518   1    0
4519   1    0
4520   0    1

[4521 rows x 2 columns]
      no  yes
0      1    0
1      1    0
2      1    0
3      1    0
4      1    0
...   ..  ...
4516   1    0
4517   1    0
4518   1    0
4519   1    0
4520   1    0

[4521 rows x 2 columns]